# first_name = "ada"                            
# last_name = "lovelance"                       
# full_name = first_name + " " + last_name      

# print('Hello,'+ " " + full_name.title() + "!")

# Сделанно для того что бы Отображалась первая бука в верхнем регистре

# ________________________________________________________________________________________________________________________________
# favorite_language = " Johny"
# favorite_language = favorite_language.rstrip()
# print(favorite_language)

# Убран правый пробел
# ________________________________________________________________________________________________________________________________

# name = "Johny"
# print('Hello, ' + name + " would you like to learn some Python today?")
# Конкатенация
# ________________________________________________________________________________________________________________________________

# name = "Oda Nobu"
# print(name.title(),name.upper(),name.lower())
# Код для вызова имени каждого нового слова в верхнем регистре,верхнем и нижнем.
# ________________________________________________________________________________________________________________________________

# bicycle = ["reline", "Stels", "ns bike", "darkmoor",]
# print(bicycle)


# Работа со списком

# ________________________________________________________________________________________________________________________________

# bicycles = ["reline", "Stels", "ns bike", "darkmoor",]
# print('My first bicycles was a ' + bicycles[-2].title())

# Индексация и Конкатенация списка

# ________________________________________________________________________________________________________________________________
